Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti Constructor
Overload List
Name | Description
AnalysisDesignParameterMulti(Int32)
 Initializes a new instance of the AnalysisDesignParameterMulti class.
AnalysisDesignParameterMulti(String, Int32, Identifier)
 Initializes a new instance of the AnalysisDesignParameterMulti class.
Top
See Also
Reference
AnalysisDesignParameterMulti Class
Tekla.Structures.Analysis Namespace